In [1]:
import pandas as pd
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from openpyxl) (1.1.0)

WARNING: You are using pip version 19.2.3, however version 24.0 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [2]:
df = pd.read_excel('sample_data.xlsx')

In [3]:
df.head(6)

    Name   Age            City  Gender
0   john  25.0        New York    Male
1   Emma  30.0      Los Angels  Female
2  Peter  23.0         Chicago    Male
3  Emily  34.0  San Franscisco  Female
4    abs   NaN             xyz    Male
5  Emily  34.0  San Franscisco  Female

In [4]:
df.sample(2)

    Name   Age            City  Gender
5  Emily  34.0  San Franscisco  Female
0   john  25.0        New York    Male

In [5]:
df.describe()

             Age
count   5.000000
mean   29.200000
std     5.069517
min    23.000000
25%    25.000000
50%    30.000000
75%    34.000000
max    34.000000

In [6]:
df.dtypes

Name       object
Age       float64
City       object
Gender     object
dtype: object

In [7]:
df.dropna(inplace=True)

In [8]:
df.drop_duplicates(inplace = True)

In [9]:
df

    Name   Age            City  Gender
0   john  25.0        New York    Male
1   Emma  30.0      Los Angels  Female
2  Peter  23.0         Chicago    Male
3  Emily  34.0  San Franscisco  Female